//***************************************************************************************
//
//! \file wheel_mesg.h 
//! 实现转轮消息的发送和接收
//!
//! \author    yangang
//! \version   V1.0
//! \date      2018-04-23
//! \copyright GNU Public License V3.0
//
//**************************************************************************************

#ifndef _WHEEL_MESG_H
#define _WHEEL_MESG_H

#include <stdint.h> 
#include <stdbool.h>


/*!
 * Base object class.
 */
typedef struct {
	bool val;  /*!< an bool value */
}wheel_mesg_s;

//***************************************************************************************
//
//! \brief  消息发布
//!
//! \param  wheel_mesg_s *msg：消息.
//! \retval none.
//!
//! \note   
//
//***************************************************************************************
void wheel_orb_publish(wheel_mesg_s *msg);

//***************************************************************************************
//
//! \brief  消息检测
//!
//! \param  bool *update　：　是否更新.
//! \retval none.
//!
//! \note  
//
//***************************************************************************************
void wheel_orb_check(bool *update);


//***************************************************************************************
//
//! \brief  消息拷贝
//!
//! \param  none.
//! \retval none.
//!
//! \note  
//
//***************************************************************************************
void wheel_orb_copy(wheel_mesg_s *msg);

#endif /* _WHEEL_MESG_H */

